Revit 2026 API

# BuiltInFailuresDatumPlaneFailures Class

---

Failures about DatumPlane.

SystemObject Autodesk.Revit.DBBuiltInFailuresDatumPlaneFailures

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static class DatumPlaneFailures
```
```vb
Public NotInheritable Class DatumPlaneFailures
```
```cpp
public ref class DatumPlaneFailures abstract sealed
```
```fsharp
[<AbstractClassAttribute>]
[<SealedAttribute>]
type DatumPlaneFailures = class end
```

The BuiltInFailuresDatumPlaneFailures type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | ScopeBoxWrongPosition | The Highlighted Datum cannot be associated with the specified Scope Box because the Datum plane does not intersect the Scope Box. |

#### Reference

Autodesk.Revit.DB Namespace